// 1. 将数值转换为指定进制的字符串
console.log( (1234).toString(8) );  // 2322

// 2. 设置小数位数，小数位数不足补0
console.log( (123456.7891).toFixed(5) );    // 123456.78910

// 3. 使用指数计数法，并设置小数位数，小数位数不足不0
console.log( (12.34).toExponential(5) );    // 1.23400e+1

// 4. 设置有效位数
// 4.1 整数位数 < 有效位数，在添加小数位，并在小数位补0
console.log( (12).toPrecision(4) );     // 12.00
// 4.2 整数位数 = 有效位数，返回原始数字的字符串
console.log( (12).toPrecision(2) );     // 12
// 4.3 整数位数 > 有效位数，使用指数计数法
console.log( (1234.567).toPrecision(3) );     // 1.23e+3